## Jesus Rodrigo Colina Nunez
## Student Number 2017156
## MSC_DA_CA2

In [1]:
#pip install plotly # Here we are installing plotly in case we do not have it

In [108]:
#Import Libraries

import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
import plotly.express as px
from scipy.stats import poisson
from scipy.stats import binom

from sklearn.preprocessing import MinMaxScaler

from sklearn.model_selection import train_test_split, RandomizedSearchCV
from sklearn.ensemble import RandomForestRegressor
from sklearn.metrics import mean_squared_error
from scipy.stats import norm

from statsmodels.tools.eval_measures import mse, rmse

import warnings
warnings.filterwarnings('ignore') # We can suppress the warnings

In [109]:
#!pip install xlrd 

#In order to read xlrd files

In [110]:
# Load Files

df_DublinLuas = pd.read_csv('LuasPassengerNumbers.csv') 

df_DublinLuas1 = pd.read_csv('PassengerJourneysbyLuas.csv') 

# read an excel file
df_SubteBA1 = pd.read_excel('SubteBuenosAires.xlsx')

In [111]:
df_DublinLuas.shape # Here we check the size of the dataset How many columns and rows

(195, 8)

In [112]:
df_DublinLuas1.shape

(780, 8)

In [113]:
df_DublinLuas.head(100)

,STATISTIC,Statistic Label,TLIST(A1),Year,C01885V02316,Month,UNIT,VALUE
0,TOA11C01,Red line,2018,2018,01,January,Number,1664495
1,TOA11C01,Red line,2018,2018,02,February,Number,1657562
2,TOA11C01,Red line,2018,2018,03,March,Number,1661098
3,TOA11C01,Red line,2018,2018,04,April,Number,1794424
4,TOA11C01,Red line,2018,2018,05,May,Number,1934553
...,...,...,...,...,...,...,...,...
95,TOA11C02,Green line,2020,2020,05,May,Number,152570
96,TOA11C02,Green line,2020,2020,06,June,Number,350566
97,TOA11C02,Green line,2020,2020,07,July,Number,620358
98,TOA11C02,Green line,2020,2020,08,August,Number,698594
99,TOA11C02,Green line,2020,2020,09,September,Number,763488

In [114]:
df_DublinLuas1.head(100)

,STATISTIC,Statistic Label,TLIST(W1),Week,C03132V03784,Luas Line,UNIT,VALUE
0,TII03C01,Passenger Journeys,2019W01,2019 Week 01,-,All Luas lines,Number,549533.0
1,TII03C01,Passenger Journeys,2019W01,2019 Week 01,1,Red line,Number,274139.0
2,TII03C01,Passenger Journeys,2019W01,2019 Week 01,2,Green line,Number,275394.0
3,TII03C01,Passenger Journeys,2019W02,2019 Week 02,-,All Luas lines,Number,839022.0
4,TII03C01,Passenger Journeys,2019W02,2019 Week 02,1,Red line,Number,408199.0
...,...,...,...,...,...,...,...,...
95,TII03C01,Passenger Journeys,2019W32,2019 Week 32,2,Green line,Number,384389.0
96,TII03C01,Passenger Journeys,2019W33,2019 Week 33,-,All Luas lines,Number,868677.0
97,TII03C01,Passenger Journeys,2019W33,2019 Week 33,1,Red line,Number,445915.0
98,TII03C01,Passenger Journeys,2019W33,2019 Week 33,2,Green line,Number,422762.0
99,TII03C01,Passenger Journeys,2019W34,2019 Week 34,-,All Luas lines,Number,862939.0

In [130]:
df_DublinLuas1.dtypes

STATISTIC           object
Statistic Label     object
TLIST(W1)           object
Week                object
C03132V03784        object
Luas Line           object
UNIT                object
VALUE              float64
dtype: object

In [115]:


df_SubteBA1.head(20)

,MES,TOTAL,LINEA A,LINEA B,LINEA C,LINEA D,LINEA E,LINEA H,Pemetro
0,2010,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,Enero,18400465,3221968.0,5429265.0,3869637.0,4239486.0,1299757.0,255146.0,85206.0
2,Febrero,19063147,3335755.0,5547937.0,3776980.0,4736295.0,1349138.0,243586.0,73456.0
3,Marzo,25439123,4467167.0,7318728.0,4735548.0,6664063.0,1859415.0,316007.0,78195.0
4,Abril,24538311,4371793.0,6907448.0,4662661.0,6429258.0,1791520.0,301660.0,73971.0
5,Mayo,24577749,4254514.0,6887118.0,4758640.0,6437735.0,1836516.0,312436.0,90790.0
6,Junio,25613877,4435151.0,7396539.0,4974413.0,6505335.0,1871141.0,337630.0,93668.0
7,Julio,26056344,4460665.0,7683479.0,5014360.0,6708541.0,1757642.0,341509.0,90148.0
8,Agosto,27317442,4637966.0,7881651.0,5166576.0,7208916.0,1979066.0,353430.0,89837.0
9,Septiembre,27900595,4603717.0,8101275.0,5317462.0,7392462.0,2031498.0,362235.0,91946.0
10,Octubre,24479060,4211089.0,6768838.0,4749099.0,6530144.0,1797830.0,330977.0,91083.0
11,Noviembre,27548701,4714739.0,7804107.0,5288420.0,7285189.0,1985280.0,363934.0,107032.0
12,Diciembre,24802667,4143503.0,7010053.0,4910421.0,6353059.0,1765751.0,523264.0,96616.0
13,2011,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
14,Enero,20261633,3523564.0,5773534.0,4161220.0,4832912.0,1417531.0,471198.0,81674.0
15,Febrero,21047296,3610118.0,5896177.0,4073081.0,5456029.0,1456832.0,479420.0,75639.0
16,Marzo,24127900,3825835.0,6715787.0,4585435.0,6543142.0,1810065.0,563979.0,83657.0
17,Abril,25591393,3863246.0,7029332.0,4912696.0,7147538.0,1947405.0,611507.0,79669.0
18,Mayo,27572467,4327525.0,7605746.0,5245687.0,7598681.0,2060867.0,658661.0,75300.0
19,Junio,27487733,4333745.0,7691144.0,5174618.0,7523886.0,2011220.0,686719.0,66401.0

The structure of this Excel file is not that bad but the columns need some rearrangement for clarity. .

So to start I will clean up the data by removing unnecessary rows and setting appropriate column headers. then I will sort the data by year and month. 



We also noticed that the names are in spanish, I will changed them to english but at a later steps. 

Lets beggin =)

In [116]:
# Here I separeted the column Mes and Año because they were in the same column

df_SubteBA1['Año'] = df_SubteBA1['MES'].apply(lambda x: x if isinstance(x, int) else None)
df_SubteBA1['Mes'] = df_SubteBA1['MES'].apply(lambda x: x if isinstance(x, str) else None)

# Here I fill the year values that were mising 
df_SubteBA1['Año'].fillna(method='ffill', inplace=True)

df_SubteBA1.drop('MES', axis=1, inplace=True)

# Here we have and Idea how our data set look like
df_SubteBA1.head()

,TOTAL,LINEA A,LINEA B,LINEA C,LINEA D,LINEA E,LINEA H,Pemetro,Año,Mes
0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,2010.0,None
1,18400465,3221968.0,5429265.0,3869637.0,4239486.0,1299757.0,255146.0,85206.0,2010.0,Enero
2,19063147,3335755.0,5547937.0,3776980.0,4736295.0,1349138.0,243586.0,73456.0,2010.0,Febrero
3,25439123,4467167.0,7318728.0,4735548.0,6664063.0,1859415.0,316007.0,78195.0,2010.0,Marzo
4,24538311,4371793.0,6907448.0,4662661.0,6429258.0,1791520.0,301660.0,73971.0,2010.0,Abril

In [117]:
# We delete all the rows where the colum Mes is None 
df_SubteBA1 = df_SubteBA1.dropna(subset=['Mes'])

# Here we show our data set how it looks like
df_SubteBA1.head()

,TOTAL,LINEA A,LINEA B,LINEA C,LINEA D,LINEA E,LINEA H,Pemetro,Año,Mes
1,18400465,3221968.0,5429265.0,3869637.0,4239486.0,1299757.0,255146.0,85206.0,2010.0,Enero
2,19063147,3335755.0,5547937.0,3776980.0,4736295.0,1349138.0,243586.0,73456.0,2010.0,Febrero
3,25439123,4467167.0,7318728.0,4735548.0,6664063.0,1859415.0,316007.0,78195.0,2010.0,Marzo
4,24538311,4371793.0,6907448.0,4662661.0,6429258.0,1791520.0,301660.0,73971.0,2010.0,Abril
5,24577749,4254514.0,6887118.0,4758640.0,6437735.0,1836516.0,312436.0,90790.0,2010.0,Mayo

In [118]:
# Rearange the clumn names 
new_column_order = ['Año', 'Mes', 'TOTAL', 'LINEA A', 'LINEA B', 'LINEA C', 'LINEA D', 'LINEA E', 'LINEA H', 'Pemetro']
df_SubteBA1 = df_SubteBA1[new_column_order]

# Here we see how it looks like
df_SubteBA1.head()

,Año,Mes,TOTAL,LINEA A,LINEA B,LINEA C,LINEA D,LINEA E,LINEA H,Pemetro
1,2010.0,Enero,18400465,3221968.0,5429265.0,3869637.0,4239486.0,1299757.0,255146.0,85206.0
2,2010.0,Febrero,19063147,3335755.0,5547937.0,3776980.0,4736295.0,1349138.0,243586.0,73456.0
3,2010.0,Marzo,25439123,4467167.0,7318728.0,4735548.0,6664063.0,1859415.0,316007.0,78195.0
4,2010.0,Abril,24538311,4371793.0,6907448.0,4662661.0,6429258.0,1791520.0,301660.0,73971.0
5,2010.0,Mayo,24577749,4254514.0,6887118.0,4758640.0,6437735.0,1836516.0,312436.0,90790.0

In [119]:
df_SubteBA1.info

<bound method DataFrame.info of         Año         Mes     TOTAL    LINEA A    LINEA B    LINEA C    LINEA D  \
1    2010.0       Enero  18400465  3221968.0  5429265.0  3869637.0  4239486.0
2    2010.0     Febrero  19063147  3335755.0  5547937.0  3776980.0  4736295.0
3    2010.0       Marzo  25439123  4467167.0  7318728.0  4735548.0  6664063.0
4    2010.0       Abril  24538311  4371793.0  6907448.0  4662661.0  6429258.0
5    2010.0        Mayo  24577749  4254514.0  6887118.0  4758640.0  6437735.0
..      ...         ...       ...        ...        ...        ...        ...
175  2023.0       Junio  19480456  3611442.0  4818834.0  2719364.0  4624912.0
176  2023.0       Julio  20353351  3818226.0  5041549.0  3098744.0  4680619.0
177  2023.0      Agosto  21279617  3926598.0  5131106.0  3154456.0  4942118.0
178  2023.0  Septiembre  21402837  3927178.0  5101320.0  3196849.0  4897334.0
179  2023.0     Octubre  21312142  3917304.0  5073359.0  3197544.0  4868232.0

       LINEA E    LINEA H  Pemetro
1    1299757.0   255146.0  85206.0
2    1349138.0   243586.0  73456.0
3    1859415.0   316007.0  78195.0
4    1791520.0   301660.0  73971.0
5    1836516.0   312436.0  90790.0
..         ...        ...      ...
175  1618430.0  2031516.0  55958.0
176  1544510.0  2107510.0  62193.0
177  1820639.0  2242765.0  61935.0
178  1926218.0  2290716.0  63222.0
179  1947113.0  2246537.0  62053.0

[166 rows x 10 columns]>

In [128]:
df_SubteBA1.dtypes

#We see the data types and we noticed that year and month need to be changed

Año          int32
Mes         object
TOTAL       object
LINEA A    float64
LINEA B    float64
LINEA C    float64
LINEA D    float64
LINEA E    float64
LINEA H    float64
Pemetro    float64
dtype: object

In [129]:
# Here I changed the colum year to integer and month to string
df_SubteBA1['Año'] = df_SubteBA1['Año'].astype(int)
df_SubteBA1['Mes'] = df_SubteBA1['Mes'].astype(str)

In [122]:
# Verify 
df_SubteBA1.dtypes

Año          int32
Mes         object
TOTAL       object
LINEA A    float64
LINEA B    float64
LINEA C    float64
LINEA D    float64
LINEA E    float64
LINEA H    float64
Pemetro    float64
dtype: object

In [123]:
df_SubteBA1.head()

,Año,Mes,TOTAL,LINEA A,LINEA B,LINEA C,LINEA D,LINEA E,LINEA H,Pemetro
1,2010,Enero,18400465,3221968.0,5429265.0,3869637.0,4239486.0,1299757.0,255146.0,85206.0
2,2010,Febrero,19063147,3335755.0,5547937.0,3776980.0,4736295.0,1349138.0,243586.0,73456.0
3,2010,Marzo,25439123,4467167.0,7318728.0,4735548.0,6664063.0,1859415.0,316007.0,78195.0
4,2010,Abril,24538311,4371793.0,6907448.0,4662661.0,6429258.0,1791520.0,301660.0,73971.0
5,2010,Mayo,24577749,4254514.0,6887118.0,4758640.0,6437735.0,1836516.0,312436.0,90790.0

In [127]:
# we save the changes to a new file in case we mesed up so we have copies of both files.

#output_file_path = 'C:/Users/AW/Desktop/CA2/SubteBuenosAires2.xlsx'

# save my modified dataset
#df_SubteBA1.to_excel(output_file_path, index=False)

In [131]:
df_SubteBA2 = pd.read_excel('SubteBuenosAires2.xlsx')

In [132]:
df_SubteBA2.head()

,Año,Mes,TOTAL,LINEA A,LINEA B,LINEA C,LINEA D,LINEA E,LINEA H,Pemetro
0,2010,Enero,18400465,3221968,5429265,3869637,4239486,1299757,255146,85206
1,2010,Febrero,19063147,3335755,5547937,3776980,4736295,1349138,243586,73456
2,2010,Marzo,25439123,4467167,7318728,4735548,6664063,1859415,316007,78195
3,2010,Abril,24538311,4371793,6907448,4662661,6429258,1791520,301660,73971
4,2010,Mayo,24577749,4254514,6887118,4758640,6437735,1836516,312436,90790